In [1]:
import pandas as pd

In [2]:
import seaborn as sns

In [3]:
##a 1D data is a series and a 2D data is a dataframe

In [4]:
df=sns.load_dataset("iris")

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [8]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [10]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [ ]:
##pandas in 10 min : https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

In [18]:
name=["ritika","vartika","shivansh"]
marks=[10,20,30]
d={'name':name,'marks':marks}

In [19]:
pd.DataFrame(d)

       name  marks
0    ritika     10
1   vartika     20
2  shivansh     30

In [20]:
import numpy as np
data=np.random.randint(10,20,(10,5))
data

array([[18, 10, 16, 16, 15],
       [16, 16, 17, 18, 10],
       [12, 19, 11, 15, 13],
       [14, 13, 10, 10, 13],
       [14, 13, 12, 17, 11],
       [18, 13, 19, 13, 17],
       [15, 16, 13, 19, 13],
       [10, 14, 10, 10, 16],
       [11, 19, 11, 15, 13],
       [19, 14, 15, 18, 13]])

In [21]:
df=pd.DataFrame(data,columns=["a","b","c","d","e"])
df

    a   b   c   d   e
0  18  10  16  16  15
1  16  16  17  18  10
2  12  19  11  15  13
3  14  13  10  10  13
4  14  13  12  17  11
5  18  13  19  13  17
6  15  16  13  19  13
7  10  14  10  10  16
8  11  19  11  15  13
9  19  14  15  18  13

In [22]:
df.T

    0   1   2   3   4   5   6   7   8   9
a  18  16  12  14  14  18  15  10  11  19
b  10  16  19  13  13  13  16  14  19  14
c  16  17  11  10  12  19  13  10  11  15
d  16  18  15  10  17  13  19  10  15  18
e  15  10  13  13  11  17  13  16  13  13